In [1]:
# import pandas
import pandas as pd

In [3]:
# link to the data to be used
data_link = 'http://bit.ly/2cLzoxH'

# get data from the link as Pandas DataFrame
df = pd.read_csv(data_link)

In [4]:
# view part of the data
df.head(4)

       country  year         pop continent  lifeExp   gdpPercap
0  Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1  Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2  Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3  Afghanistan  1967  11537966.0      Asia   34.020  836.197138

1. RENAME ALL THE COLUMNS

In [5]:
# get the names of the columns
df.columns

Index(['country', 'year', 'pop', 'continent', 'lifeExp', 'gdpPercap'], dtype='object')

In [6]:
# rename all the columns. NOTE i cnt rename some and leave some by this method. I must rename all once
df.columns = ['Country', 'Year', 'Population', 'Continent', 'Life_Exp', 'GDP_per_Cap']

In [7]:
# check to see what it looks like
df.head(3)

       Country  Year  Population Continent  Life_Exp  GDP_per_Cap
0  Afghanistan  1952   8425333.0      Asia    28.801   779.445314
1  Afghanistan  1957   9240934.0      Asia    30.332   820.853030
2  Afghanistan  1962  10267083.0      Asia    31.997   853.100710

2. USING THE 'RENAME' FUNCTION

This function is the 'hailmary' in renaming the columns and rows of a dataset

In [9]:
# change the title of some columns
df.rename(columns={'Year': 'Yr',
                  'Population': 'Pop'}, inplace=True)

# the 'inplace' arg changes the name in place

In [10]:
# take a look
df.head(3)

       Country    Yr         Pop Continent  Life_Exp  GDP_per_Cap
0  Afghanistan  1952   8425333.0      Asia    28.801   779.445314
1  Afghanistan  1957   9240934.0      Asia    30.332   820.853030
2  Afghanistan  1962  10267083.0      Asia    31.997   853.100710

In [12]:
# rename a single column
df.rename(columns={'Yr': 'Year'}, inplace=True)

df.head(3)

       Country  Year         Pop Continent  Life_Exp  GDP_per_Cap
0  Afghanistan  1952   8425333.0      Asia    28.801   779.445314
1  Afghanistan  1957   9240934.0      Asia    30.332   820.853030
2  Afghanistan  1962  10267083.0      Asia    31.997   853.100710

In [13]:
# change row names
df.rename(index={0: 'Zero',
                1: 'One'}, inplace=True)

df.head(3)

          Country  Year         Pop Continent  Life_Exp  GDP_per_Cap
Zero  Afghanistan  1952   8425333.0      Asia    28.801   779.445314
One   Afghanistan  1957   9240934.0      Asia    30.332   820.853030
2     Afghanistan  1962  10267083.0      Asia    31.997   853.100710

In [14]:
# change column name and row name simultaneousnly
df.rename(columns={'Pop': 'Population',
                  'Life_Exp': 'Life Expectancy'},
         index={'Zero': 0,
               'One': 1}, inplace=True)

df.head(4)

       Country  Year  Population Continent  Life Expectancy  GDP_per_Cap
0  Afghanistan  1952   8425333.0      Asia           28.801   779.445314
1  Afghanistan  1957   9240934.0      Asia           30.332   820.853030
2  Afghanistan  1962  10267083.0      Asia           31.997   853.100710
3  Afghanistan  1967  11537966.0      Asia           34.020   836.197138

In [ ]:
# THANK YOU!